Сравнитель/src/Catalogs/ПравилаСравненияДанных/ПравилаСравненияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаСравненияДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПриОпределенииБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыСравнения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.ОписанияТипов</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Сравнитель/src/Catalogs/ТаблицыДанных/ТаблицыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТаблицыДанных</name>
  <owners>Catalog.ПравилаСравненияДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриСравненииСтрок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСоединения</name>
    <type>
      <types>EnumRef.СпособыСоединенияТаблицДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>DefinedType.ИмяПоляТаблицыДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоля</name>
      <type>
        <types>EnumRef.ВидыПолейТаблицДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсходногоЗначения</name>
      <type>
        <types>CatalogRef.ОписанияТипов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияСравнения</name>
      <type>
        <types>CatalogRef.ОписанияТипов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриПолученииЗначенияСравнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриПолученииПредставления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСравненииЗначений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Сравнитель/src/Catalogs/ПравилаСравненияДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьВОбъектXDTO(Ссылка) Экспорт
	ПравилоСравненияXDTO = ОбщегоНазначенияСравнитель.СоздатьОбъектXDTO(1, "ПравилоСравненияДанных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаСравненияДанных.ПриОпределенииБазы КАК ПриОпределенииБазы
		|ИЗ
		|	Справочник.ПравилаСравненияДанных КАК ПравилаСравненияДанных
		|ГДЕ
		|	ПравилаСравненияДанных.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаСравненияДанныхПараметрыСравнения.Имя КАК Имя,
		|	ПравилаСравненияДанныхПараметрыСравнения.Тип КАК Тип
		|ИЗ
		|	Справочник.ПравилаСравненияДанных.ПараметрыСравнения КАК ПравилаСравненияДанныхПараметрыСравнения
		|ГДЕ
		|	ПравилаСравненияДанныхПараметрыСравнения.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаСравненияДанныхПараметрыСравнения.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицыДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТаблицыДанных КАК ТаблицыДанных
		|ГДЕ
		|	ТаблицыДанных.Владелец = &Ссылка
		|	И ТаблицыДанных.Используется";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[1].Выбрать();
	ВыборкаТаблицы = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		ПравилоСравненияXDTO.ПриОпределенииБазы = ВыборкаШапка.ПриОпределенииБазы;
	КонецЦикла;
	
	Пока ВыборкаПараметры.Следующий() Цикл
		ПараметрXDTO = ОбщегоНазначенияСравнитель.СоздатьОбъектXDTO(1, "ПравилоСравненияДанных.ПараметрСравненияДанных");
		ПараметрXDTO.Имя = ВыборкаПараметры.Имя;
		ПараметрXDTO.Тип = Справочники.ОписанияТипов.ВыгрузитьВОбъектXDTO(ВыборкаПараметры.Тип);
		ПравилоСравненияXDTO.ПараметрыСравнения.Добавить(ПараметрXDTO);
	КонецЦикла;
	
	Пока ВыборкаТаблицы.Следующий() Цикл
		ТаблицаXDTO = Справочники.ТаблицыДанных.ВыгрузитьВОбъектXDTO(ВыборкаТаблицы.Ссылка);
		ПравилоСравненияXDTO.ТаблицыДанных.Добавить(ТаблицаXDTO);
	КонецЦикла;
	
	ПравилоСравненияXDTO.Проверить();
	Возврат ПравилоСравненияXDTO;
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
